nxp-mcuxpresso/mcux-sdk-examples/frdmrw612/driver_examples/sctimer/multi_state_pwm/pin_mux.c
/*
 * Copyright 2024 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v15.0
processor: RW612
package_id: RW612ETA2I
mcu_data: ksdk2_0
processor_version: 0.15.5
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_io_mux.h"
#include "fsl_inputmux.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: cm33, enableClock: 'true'}
- pin_list:
  - {pin_num: F3, peripheral: FLEXCOMM3, signal: USART_RXD, pin_signal: GPIO_24}
  - {pin_num: N3, peripheral: SCT0, signal: 'IN, 1', pin_signal: GPIO_4}
  - {pin_num: L4, peripheral: SCT0, signal: 'OUT, 0', pin_signal: GPIO_3}
  - {pin_num: E14, peripheral: SCT0, signal: 'OUT, 8', pin_signal: GPIO_11}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : 
 *
 * END ****************************************************************************************************************/
/* Function assigned for the Cortex-M33 */
void BOARD_InitPins(void)
{
    /* pmux clock control: Enable clock */
    CLOCK_EnableClock(kCLOCK_InputMux);
    /* Initialize FC3_USART_DATA functionality on pin GPIO_24 (pin F3) */
    IO_MUX_SetPinMux(IO_MUX_FC3_USART_DATA);
    /* Initialize SCT_OUT_0 functionality on pin GPIO_3 (pin L4) */
    IO_MUX_SetPinMux(IO_MUX_SCT_OUT_0);
    /* Initialize SCT_OUT_8 functionality on pin GPIO_11 (pin E14) */
    IO_MUX_SetPinMux(IO_MUX_SCT_OUT_8);
    /* Initialize SCT_IN_1 functionality on pin GPIO_4 (pin N3) */
    IO_MUX_SetPinMux(IO_MUX_SCT_IN_1);
    /* SCT0_PIN_INP1 is selected for SCT0 input 1 */
    INPUTMUX_AttachSignal(INPUTMUX, 1U, kINPUTMUX_Gpio4Inp1ToSct0);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
